In [55]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [56]:
xls = pd.ExcelFile(r"C:\Users\SHIVAM MAHAJAN\Desktop\Github\EXL data\Stage 1.EXL_EQ2017_Telecom_Data Set_Final Ver6.0.xlsx")
demo_data = xls.parse(0,parse_dates=True)

In [57]:
demo_data.head()

,Account Number,Commence Date,Address,Scheme,Staus,Gender,Region,Sale of Equipment Status,Age,Equipment Warranty,Salary Slab,Professional Info,Age of Home,Equipment Warranty Expiry Date,Churn Date
0,M1,2011-11-04,VALID,KLA,Open,Female,Northern,RENTED,70,Three Full Years,5,0,17,2015-04-03,NaN
1,M2,2011-11-28,VALID,PPL,Open,Female,Western,RENTED,55,Three Full Years,7,0,22,2015-04-03,NaN
2,M3,2011-12-06,VALID,KLA,Open,Male,Eastern,RENTED,64,Three Full Years,1,5,17,2016-04-03,NaN
3,M4,2011-10-28,VALID,MXX,Open,Female,Northern,RENTED,66,Three Full Years,6,14,22,2015-04-03,NaN
4,M5,2015-01-18,VALID,PRP,Open,NaN,Western,RENTED,NaN,Full Year,NaN,NaN,NaN,2016-01-03,NaN

In [58]:
demo_data.shape

(14952, 15)

### Training and test data

In [59]:
def isModel(x):
    return x.startswith("M")

In [60]:
a = demo_data["Account Number"].apply(isModel)
a = np.array(a)
test_demo_data = demo_data[~a]
demo_data = demo_data[a]
test_demo_data.head()

,Account Number,Commence Date,Address,Scheme,Staus,Gender,Region,Sale of Equipment Status,Age,Equipment Warranty,Salary Slab,Professional Info,Age of Home,Equipment Warranty Expiry Date,Churn Date
9966,V1,2012-09-27,VALID,PWR,Open,NaN,Southern,RENTED,NaN,Three Full Years,NaN,NaN,NaN,2015-08-03,NaN
9967,V2,2012-01-26,VALID,PRS,Open,Female,Western,RENTED,71,Three Full Years,12,18,22,2016-08-03,NaN
9968,V3,2013-05-14,VALID,MXX,Open,Male,Eastern,BOUGHT,69,Three Full Years,9,8,22,2015-08-03,NaN
9969,V4,2011-10-12,VALID,PWM,Open,Male,Eastern,RENTED,71,Three Full Years,5,19,22,2015-07-30,NaN
9970,V5,2014-07-31,VALID,KLA,Open,Male,Northern,RENTED,61,Three Full Years,6,13,22,2016-07-15,NaN

In [61]:
train_acc = np.unique(demo_data["Account Number"])
test_acc = np.unique(test_demo_data["Account Number"])

In [62]:
demo_data.shape

(9966, 15)

In [63]:
test_demo_data.shape

(4986, 15)

### Splitting training demo data to Churners and Non Churners

In [64]:
churn_demo_data = demo_data[~demo_data["Churn Date"].isnull()]
churn_demo_data.shape

(506, 15)

In [65]:
churn_demo_data.head()

,Account Number,Commence Date,Address,Scheme,Staus,Gender,Region,Sale of Equipment Status,Age,Equipment Warranty,Salary Slab,Professional Info,Age of Home,Equipment Warranty Expiry Date,Churn Date
51,M52,2012-04-04,VALID,PWR,Open,Female,Eastern,RENTED,71,Three Full Years,5,0,17,2015-03-29,2015-05-30 00:00:00
73,M74,2012-02-08,VALID,PWP,Open,Male,Eastern,BOUGHT,59,Three Full Years,5,0,12,2015-03-25,2015-05-23 00:00:00
76,M77,2013-03-02,INVALID,PWR,Open,Female,Western,Second Hand,59,Three Full Years,6,0,22,2015-04-03,2015-05-01 00:00:00
79,M80,2012-01-19,VALID,PWM,Open,Female,Eastern,BOUGHT,51,Three Full Years,4,10,12,2015-03-29,2015-05-27 00:00:00
92,M93,2012-02-22,VALID,PWM,Open,Female,Eastern,BOUGHT,55,Three Full Years,4,0,17,2015-03-07,2015-04-05 00:00:00

In [66]:
churn_acc_num = np.unique(churn_demo_data["Account Number"])
len(churn_acc_num)

506

In [67]:
non_churn_demo_data = demo_data[demo_data["Churn Date"].isnull()]
non_churn_demo_data.head()

,Account Number,Commence Date,Address,Scheme,Staus,Gender,Region,Sale of Equipment Status,Age,Equipment Warranty,Salary Slab,Professional Info,Age of Home,Equipment Warranty Expiry Date,Churn Date
0,M1,2011-11-04,VALID,KLA,Open,Female,Northern,RENTED,70,Three Full Years,5,0,17,2015-04-03,NaN
1,M2,2011-11-28,VALID,PPL,Open,Female,Western,RENTED,55,Three Full Years,7,0,22,2015-04-03,NaN
2,M3,2011-12-06,VALID,KLA,Open,Male,Eastern,RENTED,64,Three Full Years,1,5,17,2016-04-03,NaN
3,M4,2011-10-28,VALID,MXX,Open,Female,Northern,RENTED,66,Three Full Years,6,14,22,2015-04-03,NaN
4,M5,2015-01-18,VALID,PRP,Open,NaN,Western,RENTED,NaN,Full Year,NaN,NaN,NaN,2016-01-03,NaN

In [68]:
test_non_churn_demo_data = test_demo_data[test_demo_data["Churn Date"].isnull()]
test_non_churn_demo_data.shape

(4986, 15)

In [69]:
non_churn_acc_num = np.unique(non_churn_demo_data["Account Number"])
len(non_churn_acc_num)

9460

In [70]:
pattern_data = xls.parse(4)
pattern_data.head()

,Account Number,Used pattern in hours,Usage Post Limit Utilization in hrs,data used Gb,YYYYMM
0,M1,717.90,0,43.80,201501
1,M1,662.42,0,110.35,201502
2,M1,634.68,0,109.10,201503
3,M2,696.12,5,98.40,201501
4,M2,652.40,0,70.90,201502

In [71]:
test_pattern_data = pattern_data[pattern_data["Account Number "].isin(test_acc)]
test_pattern_data.head()

,Account Number,Used pattern in hours,Usage Post Limit Utilization in hrs,data used Gb,YYYYMM
27703,V1,400.52,0,78.15,201505
27704,V1,587.93,0,37.30,201506
27705,V1,647.40,0,115.00,201507
27706,V2,699.75,232,226.30,201505
27707,V2,658.43,35,119.10,201506

In [72]:
pattern_data = pattern_data[pattern_data["Account Number "].isin(train_acc)]
pattern_data.head()

,Account Number,Used pattern in hours,Usage Post Limit Utilization in hrs,data used Gb,YYYYMM
0,M1,717.90,0,43.80,201501
1,M1,662.42,0,110.35,201502
2,M1,634.68,0,109.10,201503
3,M2,696.12,5,98.40,201501
4,M2,652.40,0,70.90,201502

In [73]:
churn_pattern_data = pattern_data[pattern_data["Account Number "].isin(churn_acc_num)]
churn_pattern_data.head()

,Account Number,Used pattern in hours,Usage Post Limit Utilization in hrs,data used Gb,YYYYMM
140,M52,742.72,0,18.55,201501
141,M52,694.60,0,11.15,201502
142,M52,709.87,0,8.45,201503
205,M74,613.13,31,209.60,201501
206,M74,523.20,0,182.75,201502

In [74]:
non_churn_pattern_data = pattern_data[~pattern_data["Account Number "].isin(churn_acc_num)]
non_churn_pattern_data.head()

,Account Number,Used pattern in hours,Usage Post Limit Utilization in hrs,data used Gb,YYYYMM
0,M1,717.90,0,43.80,201501
1,M1,662.42,0,110.35,201502
2,M1,634.68,0,109.10,201503
3,M2,696.12,5,98.40,201501
4,M2,652.40,0,70.90,201502

### Data processing - Missing value

In [75]:
churn_pattern_data.isnull().sum()

Account Number                         0
Used pattern in hours                  0
Usage Post Limit Utilization in hrs    0
data used Gb                           0
YYYYMM                                 0
dtype: int64

In [76]:
non_churn_pattern_data.isnull().sum()

Account Number                         0
Used pattern in hours                  0
Usage Post Limit Utilization in hrs    0
data used Gb                           0
YYYYMM                                 0
dtype: int64

In [77]:
churn_demo_data.isnull().sum()

Account Number                      0
Commence Date                       0
Address                            36
Scheme                              0
Staus                               0
Gender                             93
Region                              0
 Sale of Equipment Status           0
Age                               135
Equipment Warranty                141
Salary Slab                        90
Professional Info                  90
Age of Home                        90
Equipment Warranty Expiry Date    141
Churn Date                          0
dtype: int64

### Churners used hrs statistics in last 3 months

In [78]:
churn_hrs_3_months = churn_pattern_data.groupby(churn_pattern_data["Account Number "])["Used pattern in hours"].mean()
len(churn_hrs_3_months)

456

In [79]:
churn_hrs_range_3_months = np.max(churn_hrs_3_months) - np.min(churn_hrs_3_months)
churn_hrs_range_3_months

727.49000000000001

In [80]:
churn_hrs_3_months.describe()

count    456.000000
mean     540.759883
std      164.439905
min        1.080000
25%      461.952500
50%      590.406667
75%      663.257500
max      728.570000
Name: Used pattern in hours, dtype: float64

### Churners hours post limit in last 3 months statistics

In [81]:
churn_post_hrs_3_months = churn_pattern_data.groupby(churn_pattern_data["Account Number "])["Usage Post Limit Utilization in hrs"].mean()
churn_post_hrs_3_months.head()

Account Number
M1055    45.000000
M1062     0.000000
M1109    38.666667
M1128     0.000000
M1156     0.000000
Name: Usage Post Limit Utilization in hrs, dtype: float64

In [82]:
churn_post_hrs_range_3_months = np.max(churn_post_hrs_3_months) - np.min(churn_post_hrs_3_months)
churn_post_hrs_range_3_months

490.0

In [83]:
churn_post_hrs_3_months.describe()

count    456.000000
mean      65.053728
std      104.223057
min        0.000000
25%        0.000000
50%        0.000000
75%       99.500000
max      490.000000
Name: Usage Post Limit Utilization in hrs, dtype: float64

### Non Churners used hrs statistics in last 3 months

In [84]:
non_churn_hrs_3_months = non_churn_pattern_data.groupby(non_churn_pattern_data["Account Number "])["Used pattern in hours"].mean()
non_churn_hrs_3_months.head()

Account Number
M1        671.666667
M10       604.800000
M100      694.143333
M1000     412.490000
M10000    689.690000
Name: Used pattern in hours, dtype: float64

In [85]:
non_churn_hrs_3_months.describe()

count    9181.000000
mean      612.244067
std       126.204761
min         1.050000
25%       585.320000
50%       646.226667
75%       692.310000
max       729.393333
Name: Used pattern in hours, dtype: float64

In [86]:
non_churn_hrs_range_3_months = 729.39-1.05
non_churn_hrs_range_3_months

728.34

### Non Churners post used hours statistics in last 3 months

In [87]:
non_churn_post_hrs_3_months = non_churn_pattern_data.groupby(non_churn_pattern_data["Account Number "])["Usage Post Limit Utilization in hrs"].mean()
non_churn_post_hrs_3_months.head()

Account Number
M1          0
M10         0
M100        0
M1000       0
M10000    199
Name: Usage Post Limit Utilization in hrs, dtype: float64

In [88]:
non_churn_post_hrs_3_months.describe()

count    9181.000000
mean       54.243292
std        97.346963
min         0.000000
25%         0.000000
50%         0.000000
75%        71.000000
max       584.000000
Name: Usage Post Limit Utilization in hrs, dtype: float64

### Default Sum

In [89]:
default_data = xls.parse(3)
default_data.head()

  Account Number date of default  Default sum
0           M100      2015-02-25       1037.2
1           M104      2015-03-13        611.8
2           M114      2015-03-07       2193.5
3           M125      2015-03-02        507.8
4           M132      2015-02-27       1405.5

#### Splitting to training and test data.

In [90]:
train_default_data = default_data[default_data["Account Number"].isin(train_acc)]
test_default_data = default_data[default_data["Account Number"].isin(test_acc)]
print train_default_data.shape
train_default_data.head()

(1687, 3)

  Account Number date of default  Default sum
0           M100      2015-02-25       1037.2
1           M104      2015-03-13        611.8
2           M114      2015-03-07       2193.5
3           M125      2015-03-02        507.8
4           M132      2015-02-27       1405.5

In [91]:
test_default_data.head()

     Account Number date of default  Default sum
1692             V5      2015-07-13        713.4
1693            V48      2015-07-01       1402.8
1694            V74      2015-07-11        899.9
1695            V79      2015-06-29       1483.2
1696            V95      2015-05-30       1350.3

In [92]:
churn_default_data = train_default_data[train_default_data["Account Number"].isin(churn_acc_num)]
non_churn_default_data = train_default_data[~train_default_data["Account Number"].isin(churn_acc_num)]
print churn_default_data.shape, non_churn_default_data.shape
churn_default_data.head()

(270, 3) (1417, 3)

   Account Number date of default  Default sum
4            M132      2015-02-27       1405.5
10           M142      2015-02-05       2718.0
11           M142      2015-03-05        574.1
12           M155      2015-03-18       1825.6
25           M199      2015-03-11        672.8

### For churners, finding maximum default sum

In [93]:
churn_max_default_sum = churn_default_data.groupby(churn_default_data["Account Number"])["Default sum"].max()
churn_max_default_sum.head()

Account Number
M1109     827.1
M132     1405.5
M1374     651.6
M1412    1605.6
M142     2718.0
Name: Default sum, dtype: float64

In [94]:
churn_max_default_sum.describe()

count     192.000000
mean      834.468229
std       605.556027
min        14.900000
25%       548.525000
50%       665.000000
75%       913.975000
max      5694.700000
Name: Default sum, dtype: float64

In [95]:
churn_max_default_sum_range = 5694.7 - 14.9
churn_max_default_sum_range

5679.8

#### Non churners max default sum

In [96]:
non_churn_max_default_sum = non_churn_default_data.groupby(non_churn_default_data["Account Number"])["Default sum"].max()
non_churn_max_default_sum.head()

Account Number
M100     1037.2
M1002     938.4
M1039    1066.8
M104      611.8
M1045     649.8
Name: Default sum, dtype: float64

In [97]:
non_churn_max_default_sum.describe()

count      989.000000
mean       826.132154
std       1230.439092
min         12.200000
25%        546.000000
50%        658.100000
75%        885.800000
max      28660.400000
Name: Default sum, dtype: float64

In [98]:
non_churn_max_default_sum_range = 28660.4 - 12.2
non_churn_max_default_sum_range

28648.2

### Payment data

In [102]:
payments_data = xls.parse(2)
print payments_data.shape
payments_data.head()

(40444, 4)

  Account Number Realization Date       Sum          Mode
0             M1       2015-03-01  1209.810   Card II TYPE
1             M1       2015-02-01  1209.810   Card II TYPE
2             M1       2015-01-01  1209.810   Card II TYPE
3             M2       2015-03-01   751.695   Card II TYPE
4             M2       2015-02-01   751.695   Card II TYPE

#### Splitting to training and testing data

In [104]:
train_payments_data = payments_data[payments_data["Account Number"].isin(train_acc)]
test_payments_data = payments_data[payments_data["Account Number"].isin(test_acc)]
print train_payments_data.shape, test_payments_data.shape
test_payments_data.head()

(27664, 4) (12645, 4)

      Account Number Realization Date       Sum          Mode
27757             V1       2015-06-01  2061.465   Card II TYPE
27758             V1       2015-05-01   748.965   Card II TYPE
27759             V1       2015-07-01   748.965   Card II TYPE
27760             V2       2015-06-01   824.670   Card II TYPE
27761             V2       2015-05-01   824.670   Card II TYPE

#### Splitting to churners and non churners

In [106]:
churn_payments_data = train_payments_data[train_payments_data["Account Number"].isin(churn_acc_num)]
non_churn_payments_data = train_payments_data[~train_payments_data["Account Number"].isin(churn_acc_num)]
print churn_payments_data.shape, non_churn_payments_data.shape
churn_payments_data.head()

(1110, 4) (26554, 4)

    Account Number Realization Date      Sum             Mode
86             M52       2015-03-27   720.09      Card II TYPE
87             M52       2015-02-27   720.09      Card II TYPE
88             M52       2015-01-27   720.09      Card II TYPE
224           M210       2015-03-08  2152.29  Paper based/Post
225           M210       2015-02-07  2152.29  Paper based/Post

#### Churners last month total payment

In [145]:
#def last_month_sum()
churn_payments_last_month = churn_payments_data.groupby(churn_payments_data["Account Number"])["Realization Date"].max()
churn_payments_last_month.head()

Account Number
M1055   2015-03-17
M1062   2015-03-21
M1109   2015-02-03
M1128   2015-03-16
M1156   2015-03-05
Name: Realization Date, dtype: datetime64[ns]

In [164]:
churn_payments_sum = []
for acc in churn_payments_last_month.index:
    date = churn_payments_last_month[acc]
    churn_payments_sum.append(churn_payments_data[(churn_payments_data["Account Number"] == acc) & \
                                                  (churn_payments_data["Realization Date"] == date)].Sum.iloc[0])
churn_payments_sum = np.array(churn_payments_sum)
churn_payments_sum_last_month = pd.DataFrame(churn_payments_last_month)
churn_payments_sum_last_month["Sum"] = churn_payments_sum
churn_payments_sum_last_month.reset_index()
churn_payments_sum_last_month.head()

               Realization Date       Sum
Account Number
M1055                2015-03-17   752.325
M1062                2015-03-21  1484.385
M1109                2015-02-03   687.645
M1128                2015-03-16   918.120
M1156                2015-03-05   742.035

In [165]:
churn_payments_sum_last_month.Sum.describe()

count     462.000000
mean      809.356818
std       455.002448
min         1.575000
25%       644.542500
50%       753.060000
75%       918.067500
max      5748.435000
Name: Sum, dtype: float64

In [177]:
# Last data is calculated on the basis of last payment rather than last month.
np.sum(churn_payments_data.groupby(churn_payments_data["Account Number"])["Realization Date"].count() > 3)

14

#### Non churners last month total payment

In [178]:
non_churn_payments_last_month = non_churn_payments_data.groupby(non_churn_payments_data["Account Number"])["Realization Date"].max()
non_churn_payments_last_month.head()

Account Number
M1       2015-03-01
M10      2015-03-09
M1000    2015-03-09
M10000   2015-03-01
M1001    2015-03-04
Name: Realization Date, dtype: datetime64[ns]

In [179]:
non_churn_payments_sum = []
for acc in non_churn_payments_last_month.index:
    date = non_churn_payments_last_month[acc]
    non_churn_payments_sum.append(non_churn_payments_data[(non_churn_payments_data["Account Number"] == acc) & \
                                                  (non_churn_payments_data["Realization Date"] == date)].Sum.iloc[0])
non_churn_payments_sum = np.array(non_churn_payments_sum)
non_churn_payments_sum_last_month = pd.DataFrame(non_churn_payments_last_month)
non_churn_payments_sum_last_month["Sum"] = non_churn_payments_sum
non_churn_payments_sum_last_month.reset_index()
non_churn_payments_sum_last_month.head()

               Realization Date       Sum
Account Number
M1                   2015-03-01  1209.810
M10                  2015-03-09  1171.695
M1000                2015-03-09   868.140
M10000               2015-03-01  1009.575
M1001                2015-03-04   965.370

In [180]:
non_churn_payments_sum_last_month.Sum.describe()

count     9182.000000
mean       838.123986
std        445.633625
min          0.210000
25%        648.690000
50%        768.232500
75%        958.230000
max      23261.910000
Name: Sum, dtype: float64

In [181]:
# Last data is calculated on the basis of last payment rather than last month.
np.sum(non_churn_payments_data.groupby(non_churn_payments_data["Account Number"])["Realization Date"].count() > 3)

346

In [182]:
non_churn_payments_sum_last_month[non_churn_payments_sum_last_month.Sum == 23261.91]

               Realization Date       Sum
Account Number
M4091                2015-03-03  23261.91

In [183]:
non_churn_payments_data[non_churn_payments_data["Account Number"] == "M4091"]

      Account Number Realization Date        Sum             Mode
11415          M4091       2015-03-03  23261.910  Paper based/Post
11416          M4091       2015-02-09     34.125  Paper based/Post
11417          M4091       2015-02-09  23261.910  Paper based/Post
11418          M4091       2015-01-05   7496.055  Paper based/Post
11419          M4091       2015-01-26  14991.795  Paper based/Post

In [184]:
non_churn_demo_data[non_churn_demo_data["Account Number"] == "M4091"]

,Account Number,Commence Date,Address,Scheme,Staus,Gender,Region,Sale of Equipment Status,Age,Equipment Warranty,Salary Slab,Professional Info,Age of Home,Equipment Warranty Expiry Date,Churn Date
4056,M4091,2014-01-30,INVALID,MXX,Closed,Female,Northern,RENTED,88,NaN,3,0,17,NaT,NaN

#### Shocking!

In [228]:
call_centre_data = xls.parse(1)
print(call_centre_data.shape)
call_centre_data.head()

(12674, 3)

  Account Number Query Date                      Full Statement of the Enquiry
0             M2 2015-03-12  FDAEDBG!-Initial LevelPayment Settlement-Accou...
1             M2 2015-03-15  FDA!CEGD-Initial LevelTech-Operational Capabil...
2             M2 2015-03-25  FDCE#GHA-Initial LevelTech-Operational Capabil...
3             M2 2015-03-28  FDC#FAAD-Initial LevelPayment Settlement-Opera...
4             M2 2015-03-29  FDC!HGF#-Initial LevelPayment Settlement-Accou...

In [229]:
train_call_centre_data = call_centre_data[call_centre_data["Account Number"].isin(train_acc)]
train_call_centre_data.shape

(7944, 3)

In [203]:
def modify_complaint(string):
    return re.findall("F.+-Initial Level(.+)",string)[0].split("-")

In [230]:
train_call_centre_data["Full Statement of the Enquiry"].iloc[0:20]

0     FDAEDBG!-Initial LevelPayment Settlement-Accou...
1     FDA!CEGD-Initial LevelTech-Operational Capabil...
2     FDCE#GHA-Initial LevelTech-Operational Capabil...
3     FDC#FAAD-Initial LevelPayment Settlement-Opera...
4     FDC!HGF#-Initial LevelPayment Settlement-Accou...
5     FDC!HH#!-Initial LevelTech-Service Order-Sched...
6     FCAH!#AH-Initial LevelTech-No support / Third ...
7     FB!HDHGE-Initial LevelPayment Settlement-Accou...
8     FCAB!#FF-Initial LevelTech-Operational Capabil...
9     FCAH!CDG-Initial LevelTech-Operational Capabil...
10    FCGG#GAF-Initial LevelTech-Utilities-Email-Cli...
11    FB#H#BFE-Initial LevelPayment Settlement-Payme...
12    FCED#GBB-Initial LevelTech-Payment Settlement-...
13    FC!EEFDF-Initial LevelPayment Settlement-Payme...
14    FB!FECEC-Initial LevelTech-Account-General Inf...
15    FB!FFB!C-Initial LevelPayment Settlement-Accou...
16    FB!#!BEE-Initial LevelTech-Utilities-Email-Web...
17    FCB#HGG#-Initial LevelPayment Settlement-Accou...
18    FCEGEB#D-Initial LevelTech-Operational Capabil...
19    FCF#C#F#-Initial LevelPayment Settlement-Opera...
Name: Full Statement of the Enquiry, dtype: object

In [190]:
import re

In [284]:
req_string = "payment operation account utilit"

In [232]:
def modify_complaint2(string):
    return re.findall("F.+-Initial Level(.+)",string)[0].split("-")

In [233]:
from collections import Counter

In [288]:
def modify_complaint(string):
    complaints = re.findall("F.+-Initial Level(.+)",string)[0].split("-")
    req_list = []
    for item in req_string.split(" "):
        for comp in complaints:
            if item in comp.lower():
                req_list.append(item)
    return req_list

In [286]:
train_call_centre_data["complaints"] = train_call_centre_data["Full Statement of the Enquiry"].apply(modify_complaint2)
print np.sum(train_call_centre_data.isnull())
train_call_centre_data.head()
# To be grouped into - Operational Inquiry, Payment Settlements, Utilities, Account

Account Number                   0
Query Date                       0
Full Statement of the Enquiry    0
complaints                       0
dtype: int64

C:\Users\SHIVAM MAHAJAN\Anaconda\lib\site-packages\ipykernel\__main__.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  if __name__ == '__main__':

,Account Number,Query Date,Full Statement of the Enquiry,complaints
0,M2,2015-03-12,FDAEDBG!-Initial LevelPayment Settlement-Accou...,"[Payment Settlement, Account, Change, General ..."
1,M2,2015-03-15,FDA!CEGD-Initial LevelTech-Operational Capabil...,"[Tech, Operational Capabilities, Browsing, No ..."
2,M2,2015-03-25,FDCE#GHA-Initial LevelTech-Operational Capabil...,"[Tech, Operational Capabilities, Browsing, No ..."
3,M2,2015-03-28,FDC#FAAD-Initial LevelPayment Settlement-Opera...,"[Payment Settlement, Operational Capabilities,..."
4,M2,2015-03-29,FDC!HGF#-Initial LevelPayment Settlement-Accou...,"[Payment Settlement, Account, General Informat..."

In [289]:
train_call_centre_data["complaints"] = train_call_centre_data["Full Statement of the Enquiry"].apply(modify_complaint)
train_call_centre_data.head()

C:\Users\SHIVAM MAHAJAN\Anaconda\lib\site-packages\ipykernel\__main__.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  if __name__ == '__main__':

,Account Number,Query Date,Full Statement of the Enquiry,complaints
0,M2,2015-03-12,FDAEDBG!-Initial LevelPayment Settlement-Accou...,"[payment, account]"
1,M2,2015-03-15,FDA!CEGD-Initial LevelTech-Operational Capabil...,[operation]
2,M2,2015-03-25,FDCE#GHA-Initial LevelTech-Operational Capabil...,[operation]
3,M2,2015-03-28,FDC#FAAD-Initial LevelPayment Settlement-Opera...,"[payment, operation]"
4,M2,2015-03-29,FDC!HGF#-Initial LevelPayment Settlement-Accou...,"[payment, account]"

In [291]:
complaints_of_different_accounts = train_call_centre_data.groupby(train_call_centre_data["Account Number"])\
                                                                                            ["complaints"].apply(union)
complaints_of_different_accounts.head()

Account Number
M100                      [payment]
M1002                     [payment]
M1007            [account, payment]
M101     [account, utilit, payment]
M1010                   [operation]
Name: complaints, dtype: object

In [295]:
complaints_count = {
}
for i in range(len(complaints_of_different_accounts)):
    for comp in complaints_of_different_accounts[i]:
        complaints_count[comp] = complaints_count.get(comp,0) + 1

In [296]:
complaints_count

{'account': 1609, 'operation': 1329, 'payment': 2753, 'utilit': 355}